
class Hadith {
  final int id;
  final String title;
  final String sanad;
  final String matn;

  Hadith({
    required this.id,
    required this.title,
    required this.sanad,
    required this.matn,
  });
}

List<Hadith> ahadithList = [
  Hadith(
    id: 1,
    title: "الحديث الأول",
    sanad: "عن أمير المؤمنين أبي حفص عمر بن الخطاب رضي الله عنه قال...",
    matn: "إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى...",
  ),
  Hadith(
    id: 2,
    title: "الحديث الثاني",
    sanad: "عن عمر رضي الله عنه أيضًا قال...",
    matn: "بني الإسلام على خمس: شهادة أن لا إله إلا الله، وأن محمدًا رسول الله...",
  ),
  Hadith(
    id: 3,
    title: "الحديث الثالث",
    sanad: "عن ابن عمر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم:",
    matn: "أول ما يحاسب به العبد يوم القيامة الصلاة، فإن صلحت فقد أفلح وأنجح، وإن فسدت فقد خاب وخسر.",
  ),
  Hadith(
    id: 4,
    title: "الحديث الرابع",
    sanad: "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:",
    matn: "من كان يؤمن بالله واليوم الآخر فليقل خيرًا أو ليصمت...",
  ),
  Hadith(
    id: 5,
    title: "الحديث الخامس",
    sanad: "عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم:",
    matn: "إذا أقيمت الصلاة فلا تأتوها تسعون، وأتوها تمشون، وعليكم السكينة والوقار، فما أدركتم فصلوا وما فاتكم فأتموا.",
  ),
  Hadith(
    id: 6,
    title: "الحديث السادس",
    sanad: "عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:",
    matn: "لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه.",
  ),
  Hadith(
    id: 7,
    title: "الحديث السابع",
    sanad: "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:",
    matn: "إذا أحب الله عبدًا ابتلاه، فإن صبر اجتباه، وإن رضي اصطفاه.",
  ),
  Hadith(
    id: 8,
    title: "الحديث الثامن",
    sanad: "عن أبي ذر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:",
    matn: "اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن.",
  ),
  Hadith(
    id: 9,
    title: "الحديث التاسع",
    sanad: "عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:",
    matn: "من سلك طريقًا يطلب فيه علمًا سهل الله له طريقًا إلى الجنة.",
  ),
  Hadith(
    id: 10,
    title: "الحديث العاشر",
    sanad: "عن معاذ بن جبل رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:",
    matn: "ليس منّا من لم يرحم صغيرنا ويوقّر كبيرنا.",
  ),
];